# St7GetSRAType

Returns the spectrum type used for Spectral Response analysis.

long St7GetSRAType(long uID, long* SpectrumType)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
SpectrumType
Type of spectrum supplied; either stResponse or stPSD.